openfoam/test_cases/rotatingPinball2D/system/setExprBoundaryFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprBoundaryFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U_inlet
{
    field   U;

    expressions
    (
        {
            patch   inlet;
            target  value;
            vel { dir (1 0 0); }
            expression #{ (pos().y() < 0.0) ? 1.01*$[(vector)vel.dir] : 0.99*$[(vector)vel.dir] #};   
        }
    );
}

// ************************************************************************* //

