openfoam/test_cases/rotatingPinball2D/Allrun.pre
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# create mesh
runApplication blockMesh
runApplication topoSet

# decompose and run case
cp -r 0.org 0
runApplication setExprBoundaryFields
runApplication decomposePar
runParallel renumberMesh -overwrite
runParallel -s "pre" pimpleFoam

#------------------------------------------------------------------------------
